loadtest/user-files/data/GetPatientInfoApSe.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:inera.se.apotekensservice:argos:1" xmlns:urn1="urn:riv:itintegration:registry:1" xmlns:urn2="urn:riv:se.apotekensservice:axs:HamtaPatientInfoResponder:6">
   <soapenv:Header>
      <urn:ArgosHeader>
         <!--Optional:-->
         <urn:forskrivarkod>9001140</urn:forskrivarkod>
 			<urn:fornamn>Daniella</urn:fornamn>
			<urn:efternamn>Jats</urn:efternamn>
			<urn:yrkesgrupp>LK</urn:yrkesgrupp>
			<urn:arbetsplatskod>4000000000000</urn:arbetsplatskod>
			<urn:arbetsplatsnamn>Vårdcentralen FORSKR</urn:arbetsplatsnamn>
			<urn:postort>Storstaden</urn:postort>
			<urn:postadress>Adress FORSKR</urn:postadress>
			<urn:postnummer>12345</urn:postnummer>
			<urn:telefonnummer>111-1111111</urn:telefonnummer>
			<urn:requestId>1629981832077</urn:requestId>
			<urn:rollnamn>FORSKRIVARE</urn:rollnamn>
			<urn:hsaID>SE01234567-8901</urn:hsaID>
			<urn:systemnamn>SoapUI</urn:systemnamn>
			<urn:systemversion>5.3.0</urn:systemversion>
			<urn:systemIp>192.168.142.105</urn:systemIp>        
      </urn:ArgosHeader>
      <urn1:LogicalAddress>${logicalAddress}</urn1:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn2:HamtaPatientInfo>
         <urn2:personnummer>${patientId}</urn2:personnummer>
         <!--Optional:-->
         <urn2:extension>
            <!--You may enter ANY elements at this point-->
         </urn2:extension>
      </urn2:HamtaPatientInfo>
   </soapenv:Body>
</soapenv:Envelope>